src/cf/Catalogs/ВизыСогласования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>ВизыСогласования</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаИсполнения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПомещенияВИсторию</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДокументыПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторУчастника</Name>
					<Comment>Идентификатор участника действия</Comment>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Исполнитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
						<v8:Type>cfg:CatalogRef.ПолныеРоли</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Источник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДействияСогласования</v8:Type>
						<v8:Type>cfg:TaskRef.ЗадачаИсполнителя</v8:Type>
						<v8:Type>cfg:BusinessProcessRef.Согласование</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерИтерации</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подписана</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоместилВИсторию</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПомещенаВИсторию</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Порядок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РезультатСогласования</Name>
					<Type>
						<v8:Type>cfg:EnumRef.РезультатыСогласования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РольИсполнителя</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПолныеРоли</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Удалена</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УстановилРезультат</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
						<v8:Type>cfg:CatalogRef.ФактическиеИсполнители</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/Catalogs/ВизыСогласования/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Возвращает массив имен ключевых реквизитов
Функция ПолучитьИменаКлючевыхРеквизитов(Версия = Неопределено) Экспорт
	
	МассивИмен = Новый Массив;
	
	// Подписание и доступность полей в карточке документа
	Если Версия = Неопределено Тогда
		МассивИмен.Добавить("Документ");
		МассивИмен.Добавить("ДатаИсполнения");
		МассивИмен.Добавить("РезультатСогласования");
		МассивИмен.Добавить("Исполнитель");
		
	// Проверка подписей
	Иначе
		
		Если Версия = 1 Тогда
			МассивИмен.Добавить("Документ");
			МассивИмен.Добавить("ДатаИсполнения");
			МассивИмен.Добавить("РезультатСогласования");
			МассивИмен.Добавить("Исполнитель");
			МассивИмен.Добавить("Наименование");
		ИначеЕсли Версия = 2 Тогда
			МассивИмен.Добавить("Документ");
			МассивИмен.Добавить("ДатаИсполнения");
			МассивИмен.Добавить("РезультатСогласования");
			МассивИмен.Добавить("Исполнитель");
			МассивИмен.Добавить("Наименование");
			МассивИмен.Добавить("ИдентификаторУчастника");
		Иначе
			МассивИмен.Добавить("Документ");
			МассивИмен.Добавить("ДатаИсполнения");
			МассивИмен.Добавить("РезультатСогласования");
			МассивИмен.Добавить("Исполнитель");
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат МассивИмен;
	
КонецФункции

// Возвращает массив авторов виз по указанному документу
Функция ПолучитьМассивАвторовВизПоДокументу(Документ) Экспорт
	
	Результат = Новый Массив;
	
	Выборка = РаботаСВизамиСогласования.ПолучитьАктивныеВизыДокумента(Документ);
	
	Для Каждого Элемент Из Выборка Цикл
		Результат.Добавить(Элемент.Исполнитель);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// Возвращает участников визы согласования.
// 
// Параметры:
//  ВизаСогласования - СправочникСсылка.ВизыСогласования - Ссылка на визу согласования
// 
// Возвращаемое значение:
//  - Структура - содержащая участников Визы.
//  
Функция УчастникиВизыСогласования(ВизаСогласования) Экспорт
	
	Возврат ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ВизаСогласования, 
		"Автор, ПоместилВИсторию, РольИсполнителя, Исполнитель, УстановилРезультат");
	
КонецФункции

#КонецОбласти

#КонецЕсли
